Revit 2027 API
RebarBarType.StandardBendDiameter Property
 Defines bar bend diameter for rebar whose style is standard
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StandardBendDiameter { get; set; }
Public Property StandardBendDiameter As Double
	Get
	Set
public:
property double StandardBendDiameter {
	double get ();
	void set (double value);
}
member StandardBendDiameter : float with get, set
Property Value
Double
 The bar bend diameter for rebar whose style is standard
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the bend diameter standardBendDiam isn't between bar diameter and 99.0
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace